app/views/posts/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT 1  [["post_id", 1]]
---
    <br>
    <% if @post.comments.any? %>