app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%%')
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "www"], ["url", "wwwww.www"], ["content", "wqwqeqweqweqweqw"], ["user_id", 1], ["created_at", "2016-12-20 19:10:49.308925"], ["updated_at", "2016-12-20 19:10:49.308925"]]
---
  def create
    @user = current_user
    @post = @user.posts.build(post_params)
    #@post = Post.new(post_params)

    respond_to do |format|
      if @post.save